spliced-components/src/Spliced/Component/Fedex/wsdl/ProcessShipmentRequest_2Day_AM_v10.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v10="http://fedex.com/ws/ship/v10">
   <soapenv:Header/>
   <soapenv:Body>
      <v10:ProcessShipmentRequest>
         <v10:WebAuthenticationDetail>
            <v10:UserCredential>
               <v10:Key></v10:Key>
               <v10:Password></v10:Password>
            </v10:UserCredential>
         </v10:WebAuthenticationDetail>
         <v10:ClientDetail>
            <v10:AccountNumber></v10:AccountNumber>
            <v10:MeterNumber></v10:MeterNumber>
           </v10:ClientDetail>
         <v10:TransactionDetail>
             <v10:CustomerTransactionId>ship_v10</v10:CustomerTransactionId>
           </v10:TransactionDetail>
         <v10:Version>
            <v10:ServiceId>ship</v10:ServiceId>
            <v10:Major>10</v10:Major>
            <v10:Intermediate>0</v10:Intermediate>
            <v10:Minor>0</v10:Minor>
         </v10:Version>
         <v10:RequestedShipment>
            <v10:ShipTimestamp>2010-12-13T09:30:47-05:00</v10:ShipTimestamp>
            <v10:DropoffType>REGULAR_PICKUP</v10:DropoffType>
            <v10:ServiceType>FEDEX_2_DAY_AM</v10:ServiceType>
            <v10:PackagingType>YOUR_PACKAGING</v10:PackagingType>
            <v10:TotalWeight>
               <v10:Units>LB</v10:Units>
               <v10:Value>50.0</v10:Value>
            </v10:TotalWeight>
           <v10:Shipper>
               <v10:AccountNumber></v10:AccountNumber>
               <v10:Contact>
                  <v10:CompanyName>FedEx-WAPI</v10:CompanyName>
                  <v10:PhoneNumber>1234567890</v10:PhoneNumber>
               </v10:Contact>
               <v10:Address>
                 <v10:StreetLines>SN2000 Test Meter 8</v10:StreetLines>
                  <v10:City>Texas</v10:City>
                  <v10:StateOrProvinceCode>TX</v10:StateOrProvinceCode>
                  <v10:PostalCode>73301</v10:PostalCode>
                   <v10:CountryCode>US</v10:CountryCode>
               </v10:Address>
            </v10:Shipper>
            <v10:Recipient>
               <v10:AccountNumber></v10:AccountNumber>
               <v10:Contact>
                  <v10:PersonName>Recipient Contact</v10:PersonName>
                   <v10:PhoneNumber>7894561230</v10:PhoneNumber>
                  </v10:Contact>
               <v10:Address>
                  <v10:StreetLines>Recipient Address Line 1</v10:StreetLines>
                  <v10:City>Auburn</v10:City>
                  <v10:StateOrProvinceCode>NH</v10:StateOrProvinceCode>
                  <v10:PostalCode>03032</v10:PostalCode>
                   <v10:CountryCode>US</v10:CountryCode>
                 </v10:Address>
            </v10:Recipient>
            <v10:ShippingChargesPayment>
               <v10:PaymentType>SENDER</v10:PaymentType>
               <v10:Payor>
                  <v10:AccountNumber></v10:AccountNumber>
                  <v10:CountryCode>US</v10:CountryCode>
               </v10:Payor>
            </v10:ShippingChargesPayment>
             <v10:LabelSpecification>
               <v10:LabelFormatType>COMMON2D</v10:LabelFormatType>
               <v10:ImageType>PNG</v10:ImageType>
               <v10:LabelStockType>PAPER_4X6</v10:LabelStockType>
              </v10:LabelSpecification>
              <v10:RateRequestTypes>ACCOUNT</v10:RateRequestTypes>
            <v10:PackageCount>1</v10:PackageCount>
             <v10:RequestedPackageLineItems>
               <v10:SequenceNumber>1</v10:SequenceNumber>
               <v10:GroupNumber>1</v10:GroupNumber>
               <v10:GroupPackageCount>1</v10:GroupPackageCount>
               <v10:Weight>
                  <v10:Units>LB</v10:Units>
                  <v10:Value>20.0</v10:Value>
               </v10:Weight>
               <v10:Dimensions>
                  <v10:Length>12</v10:Length>
                  <v10:Width>12</v10:Width>
                  <v10:Height>12</v10:Height>
                  <v10:Units>IN</v10:Units>
               </v10:Dimensions>
               <v10:ContentRecords>
                   <v10:PartNumber>123445</v10:PartNumber>
                  <v10:ItemNumber>kjdjalsro1262739827</v10:ItemNumber>
                  <v10:ReceivedQuantity>12</v10:ReceivedQuantity>
                  <v10:Description>ContentDescription</v10:Description>
               </v10:ContentRecords>
            </v10:RequestedPackageLineItems>
         </v10:RequestedShipment>
      </v10:ProcessShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>
